InformationRegisters/НастройкаПараметровУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>НастройкаПараметровУчета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НоменклатураМаксимальноСокращатьНаименованиеСокращенное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БелыйСписокНоменклатурыИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БелыйСписокНоменклатурыУчетКоличества</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧерныйСписокНоменклатурыИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧерныйСписокНоменклатурыУчетКоличества</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганизацииИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчетРабочегоВремениИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчетРабочегоВремениУчетРабочихСмен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчетРабочегоВремениКоэффициентОкругленияПериода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестаХраненияИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КатегорииКонтрагентовИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КатегорииДокументовИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КатегорииНоменклатурыИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КассовыеДатыИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтактнаяИнформацияИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтактнаяИнформацияСтраныМираИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтактнаяИнформацияГородаИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АналитическиеГруппыИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнтервалОпросаВременныхПозиций</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимыНастройкиРабочихЦентров</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыНастройкиРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимНастройкиРабочихЦентровНоменклатурныеГруппы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимНастройкиРабочихЦентровНоменклатура</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/РежимыНастройкиРабочихЦентров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>РежимыНастройкиРабочихЦентров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НоменклатурныеГруппыНоменклатура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НоменклатурныеГруппы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/НастройкаПараметровУчета/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	// При обмене данными ничего не проверяем.
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяДата = ТекущаяДата();
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		// Заполнение.
		Запись.РежимыНастройкиРабочихЦентров = __ОбщегоНазначенияКлиентСервер.ПолучитьНеПустоеЗначение(Запись.РежимыНастройкиРабочихЦентров, Перечисления.РежимыНастройкиРабочихЦентров.НоменклатурныеГруппы);
		Запись.РежимНастройкиРабочихЦентровНоменклатурныеГруппы = (Запись.РежимыНастройкиРабочихЦентров = Перечисления.РежимыНастройкиРабочихЦентров.НоменклатурныеГруппы) Или
																  (Запись.РежимыНастройкиРабочихЦентров = Перечисления.РежимыНастройкиРабочихЦентров.НоменклатурныеГруппыНоменклатура);
		Запись.РежимНастройкиРабочихЦентровНоменклатура = (Запись.РежимыНастройкиРабочихЦентров = Перечисления.РежимыНастройкиРабочихЦентров.Номенклатура) Или
														  (Запись.РежимыНастройкиРабочихЦентров = Перечисления.РежимыНастройкиРабочихЦентров.НоменклатурныеГруппыНоменклатура);
														  
		//Костенюк Александр-Старт 12.04.2016
		Запись.УчетРабочегоВремениУчетРабочихСмен 				= ?(Запись.УчетРабочегоВремениИспользовать, Запись.УчетРабочегоВремениУчетРабочихСмен, Ложь);
		Запись.УчетРабочегоВремениКоэффициентОкругленияПериода 	= ?(Запись.УчетРабочегоВремениИспользовать, Запись.УчетРабочегоВремениКоэффициентОкругленияПериода, Неопределено);
		//Костенюк Александр-Финиш 12.04.2016

	КонецЦикла;
	
КонецПроцедуры // ПередЗаписью()
